In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("automobile_data.csv")

## first 5 columns##

In [4]:
df.head()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

## last five rows

In [8]:
df.tail()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
56,81,volkswagen,sedan,97.3,171.7,ohc,four,85,27,7975.0
57,82,volkswagen,sedan,97.3,171.7,ohc,four,52,37,7995.0
58,86,volkswagen,sedan,97.3,171.7,ohc,four,100,26,9995.0
59,87,volvo,sedan,104.3,188.8,ohc,four,114,23,12940.0
60,88,volvo,wagon,104.3,188.8,ohc,four,114,23,13415.0

In [13]:
df.isnull().any()

index               False
company             False
body-style          False
wheel-base          False
length              False
engine-type         False
num-of-cylinders    False
horsepower          False
average-mileage     False
price                True
dtype: bool

## this dataset have 61 rows and 10 columns##

In [22]:
df.shape

(61, 10)

## multiplication i.e we have a total number of 610 columns and rows##

In [23]:
61*10

610

## numbers of columns in the datasets##

In [24]:
df.columns

Index(['index', 'company', 'body-style', 'wheel-base', 'length', 'engine-type',
       'num-of-cylinders', 'horsepower', 'average-mileage', 'price'],
      dtype='object')

## checking for missing values##
## false means no missing data while true means there is missing data##

In [27]:
df.isnull().any()

index               False
company             False
body-style          False
wheel-base          False
length              False
engine-type         False
num-of-cylinders    False
horsepower          False
average-mileage     False
price                True
dtype: bool

In [28]:
df.isnull()

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
56,False,False,False,False,False,False,False,False,False,False
57,False,False,False,False,False,False,False,False,False,False
58,False,False,False,False,False,False,False,False,False,False
59,False,False,False,False,False,False,False,False,False,False
60,False,False,False,False,False,False,False,False,False,False

## for entire dataframe##

In [29]:
df.isnull().any().any

<bound method NDFrame._add_numeric_operations.<locals>.any of index               False
company             False
body-style          False
wheel-base          False
length              False
engine-type         False
num-of-cylinders    False
horsepower          False
average-mileage     False
price                True
dtype: bool>

## Columns with NaN using integer

In [30]:
df.isnull().sum()

index               0
company             0
body-style          0
wheel-base          0
length              0
engine-type         0
num-of-cylinders    0
horsepower          0
average-mileage     0
price               3
dtype: int64

## Filling Missing Data ##

In [31]:
df['price'].mean()

15387.0

In [38]:
df_with_mean

0     13495.0
1     16500.0
2     16500.0
3     13950.0
4     17450.0
       ...
56     7975.0
57     7995.0
58     9995.0
59    12940.0
60    13415.0
Name: price, Length: 61, dtype: float64

In [41]:
df_with_mean = df['price'].fillna(df['price'].mean())

In [42]:
df.isnull().sum()

index               0
company             0
body-style          0
wheel-base          0
length              0
engine-type         0
num-of-cylinders    0
horsepower          0
average-mileage     0
price               3
dtype: int64

In [43]:
print(df['price'].isnull().sum())

3

In [44]:
print(df['price'].mean())

15387.0

In [46]:
df.isnull().sum()

index               0
company             0
body-style          0
wheel-base          0
length              0
engine-type         0
num-of-cylinders    0
horsepower          0
average-mileage     0
price               0
dtype: int64

In [47]:
df_with_mean

0     13495.0
1     16500.0
2     16500.0
3     13950.0
4     17450.0
       ...
56     7975.0
57     7995.0
58     9995.0
59    12940.0
60    13415.0
Name: price, Length: 61, dtype: float64

## Find the most expensive car company name. Print most expensive car’s company name
## and price.

In [ ]:
# Group by company and find the maximum price for each company

In [48]:
max_prices = df.groupby('company')['price'].max()

# Find the company with the highest maximum price

In [49]:
most_expensive_company = max_prices.idxmax()
max_price = max_prices.max()

## Most expensive car company

In [50]:
print("Most Expensive Car Company:", most_expensive_company)

Most Expensive Car Company: mercedes-benz

In [51]:
print("Price of the Most Expensive Car:", max_price)

Price of the Most Expensive Car: 45400.0

In [55]:
toyota_cars = df[df['company'] == 'oyota']

In [56]:
print(oyota_cars)

    index company body-style  wheel-base  length engine-type num-of-cylinders  \
48     66  toyota  hatchback        95.7   158.7         ohc             four
49     67  toyota  hatchback        95.7   158.7         ohc             four
50     68  toyota  hatchback        95.7   158.7         ohc             four
51     69  toyota      wagon        95.7   169.7         ohc             four
52     70  toyota      wagon        95.7   169.7         ohc             four
53     71  toyota      wagon        95.7   169.7         ohc             four
54     79  toyota      wagon       104.5   187.8        dohc              six

    horsepower  average-mileage    price
48          62               35   5348.0
49          62               31   6338.0
50          62               31   6488.0
51          62               31   6918.0
52          62               27   7898.0
53          62               27   8778.0
54         156               19  15750.0

In [54]:
print(df['company'].unique())

['alfa-romero' 'audi' 'bmw' 'chevrolet' 'dodge' 'honda' 'isuzu' 'jaguar'
 'mazda' 'mercedes-benz' 'mitsubishi' 'nissan' 'porsche' 'toyota'
 'volkswagen' 'volvo']

## Count total cars per company

In [58]:
cars_per_company = df['company'].value_counts()

In [59]:
print(cars_per_company)

toyota           7
bmw              6
mazda            5
nissan           5
mitsubishi       4
volkswagen       4
audi             4
mercedes-benz    4
porsche          3
honda            3
isuzu            3
alfa-romero      3
jaguar           3
chevrolet        3
dodge            2
volvo            2
Name: company, dtype: int64

## Find each company’s Higesht price car

In [60]:
highest_price_per_company = df.groupby('company')['price'].max()

In [61]:
print(highest_price_per_company)

company
alfa-romero      16500.0
audi             18920.0
bmw              41315.0
chevrolet         6575.0
dodge             6377.0
honda            12945.0
isuzu            15387.0
jaguar           36000.0
mazda            18344.0
mercedes-benz    45400.0
mitsubishi        8189.0
nissan           13499.0
porsche          37028.0
toyota           15750.0
volkswagen        9995.0
volvo            13415.0
Name: price, dtype: float64

## Find the average mileage of each car making company

In [62]:
average_mileage_per_company = df.groupby('company')['average-mileage'].mean()

In [63]:
print(average_mileage_per_company)

company
alfa-romero      20.333333
audi             20.000000
bmw              19.000000
chevrolet        41.000000
dodge            31.000000
honda            26.333333
isuzu            33.333333
jaguar           14.333333
mazda            28.000000
mercedes-benz    18.000000
mitsubishi       29.500000
nissan           31.400000
porsche          17.000000
toyota           28.714286
volkswagen       31.750000
volvo            23.000000
Name: average-mileage, dtype: float64

## Sort all cars by Price column

In [64]:
sorted_cars = df.sort_values(by='price', ascending=False)

In [65]:
print(sorted_cars)

    index        company   body-style  wheel-base  length engine-type  \
35     47  mercedes-benz      hardtop       112.0   199.2        ohcv
11     14            bmw        sedan       103.5   193.8         ohc
34     46  mercedes-benz        sedan       120.9   208.1        ohcv
46     62        porsche  convertible        89.5   168.9        ohcf
12     15            bmw        sedan       110.0   197.0         ohc
..    ...            ...          ...         ...     ...         ...
28     37          mazda    hatchback        93.1   159.1         ohc
36     49     mitsubishi    hatchback        93.7   157.3         ohc
48     66         toyota    hatchback        95.7   158.7         ohc
27     36          mazda    hatchback        93.1   159.1         ohc
13     16      chevrolet    hatchback        88.4   141.1           l

   num-of-cylinders  horsepower  average-mileage    price
35            eight         184               14  45400.0
11              six         182               16  41315.0
34            eight         184               14  40960.0
46              six         207               17  37028.0
12              six         182               15  36880.0
..              ...         ...              ...      ...
28             four          68               31   6095.0
36             four          68               37   5389.0
48             four          62               35   5348.0
27             four          68               30   5195.0
13            three          48               47   5151.0

[61 rows x 10 columns]

### Create two data frames using the following two dictionaries
### GermanCars = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'], 'Price': [23845, 171995,
### 135925 , 71400]}
### japaneseCars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 'Price': [29995,
### 23600, 61500 , 58900]}

In [66]:
import pandas as pd

## Define the dictionaries

In [67]:
GermanCars = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'], 'Price': [23845, 171995, 135925 , 71400]}
japaneseCars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi'], 'Price': [29995, 23600, 61500 , 58900]}

## Create DataFrames

In [68]:
df_german_cars = pd.DataFrame(GermanCars)
df_japanese_cars = pd.DataFrame(japaneseCars)

In [75]:
print("German Cars DataFrame:")
print(df_german_cars)
print("\nJapanese Cars DataFrame:")
print(df_japanese_cars)

German Cars DataFrame:
    Company   Price
0      Ford   23845
1  Mercedes  171995
2       BMV  135925
3      Audi   71400

Japanese Cars DataFrame:
      Company  Price
0      Toyota  29995
1       Honda  23600
2      Nissan  61500
3  Mitsubishi  58900